x = [7.76,6.34,5.11,7.62,8.84,4.68,8.65,6.90,8.79,6.61,6.62,7.13,6.75,...
    7.28,7.74,7.08,5.57,8.20,7.78,7.92,6.00,4.88,6.75,6.56,7.48,8.51,...
    9.06,6.94,6.93,7.79,5.71,5.93,6.81,5.76,5.88,7.05,7.22,6.67,5.59,...
    6.57,7.28,6.22,6.31,5.51,6.69,7.12,7.40,6.86,7.28,6.82,7.08,7.52,...
    6.81,7.55,4.89,5.48,7.74,5.10,8.17,7.67,7.07,5.80,6.10,7.15,7.88,...
    9.06,6.85,4.88,6.74,8.76,8.53,6.72,7.21,7.42,8.29,8.56,9.25,6.63,...
    7.49,6.67,6.79,5.19,8.20,7.97,8.64,7.36,6.72,5.90,5.53,6.44,7.35,...
    5.18,8.25,5.68,6.29,6.69,6.08,7.42,7.10,7.14,7.10,6.60,6.35,5.99,...
    6.17,9.05,6.01,7.77,6.27,5.81,7.80,9.89,4.39,6.83,6.53,8.15,6.68,...
    6.87,6.31,6.83];
x = [x zeros(1,100)+4 zeros(1,100)+10];
%x = 3*x;

M_max = max(x)
M_min = min(x)

R = M_max - M_min

n = length(x);

mu = sum(x) / n
s2 = sum((x - mu) .^ 2) / (n - 1)

m = round(log2(n)) + 2;

% интервальный стат. ряд
[counts, edges] = histcounts(x, m, 'BinLimits', [M_min, M_max])

delta = R / m;
step = delta / 10;
xs = M_min:step:M_max;
% функция плотности норм. распр.
ys = normpdf(xs, mu, sqrt(s2));

hold on
histogram('BinEdges', edges, 'BinCounts', counts / (n * delta), 'FaceColor', '#7E2F8E');

plot(xs, ys, "black");

figure
hold on

% эмпир. функция распределения
axis([2 14 0 1])
[ye, xe] = ecdf(x);
xe
stairs([2.0; xe; 14.0], [0.0; ye; 1.0], "blue");
% xlim([2 14])
% ylim([0 1])

% функция распределения норм. СВ
xs1 = 2:step:14;
yValues = zeros(1, length(xs1));
func = @(x) exp(-(x - mu).* (x - mu) / (2 * s2));
for i = 1:length(xs1)
    yValues(i) = 1 / (sqrt(s2) * sqrt(2 * pi)) * integral(func, -Inf, xs1(i));
end
plot(xs1, yValues, "black"), grid;
% xlim([2 14])
% ylim([0 1])

%xs1 = M_min:step:M_max;
%ys1 = normcdf(xs1, mu, s2);
%plot(xs1, ys1, "black");