% ID металлов (на основе СМС).
metal(p_01_01).
metal(p_01_02).
metal(p_01_03).

metal(p_02_01).
metal(p_02_02).
metal(p_02_03).

metal(p_03_11).
metal(p_03_21).

metal(p_06_01).
metal(p_06_02).
metal(p_06_03).
metal(p_06_33).

metal(m_05_11).
metal(m_05_12).
metal(m_05_13).

metal(m_05_21).
metal(m_05_22).
metal(m_05_23).

metal(m_05_51).
metal(m_05_52).

metal(m_15_11).
metal(m_15_13).

metal(m_15_21).
metal(m_15_22).

metal(m_15_51).
metal(m_15_52).

metal(k_07_01).
metal(k_07_02).

metal(k_08_01).
metal(k_08_02).

metal(k_09_01).
metal(k_09_02).

metal(n_30_11).
metal(n_30_12).

metal(n_30_21).
metal(n_30_22).

metal(n_33_01).
metal(n_33_02).
metal(n_33_03).

metal(s_20_11).
metal(s_20_12).

metal(s_20_21).
metal(s_20_22).
metal(s_20_23).

metal(s_20_31).
metal(s_20_32).
metal(s_20_33).

metal(s_23_01).

metal(s_23_21).
metal(s_23_22).

metal(h_04_01).

metal(h_10_01).

% Названия металлов.
metal_name(p_01_01, "Нелегированная сталь C = 0.1-0.25%").
metal_name(p_01_02, "Нелегированная сталь C = 0.25-0.55%").
metal_name(p_01_03, "Нелегированная сталь C = 0.55-0.80%").

metal_name(p_02_01, "Низколегированная сталь <= 5% в состоянии поставки (сырая)").
metal_name(p_02_02, "Низколегированная сталь <= 5% закаленная и отпущенная").
metal_name(p_02_03, "Низколегированная сталь <= 5% закаленная и отпущенная").

metal_name(p_03_11, "Высоколегированная сталь > 5% отожженная").
metal_name(p_03_21, "Высоколегированная сталь > 5% закаленная инструментальная").

metal_name(p_06_01, "Стальное литье нелегированное").
metal_name(p_06_02, "Стальное литье низколегированное <= 5%").
metal_name(p_06_03, "Стальное литье высоколегированное > 5%").
metal_name(p_06_23, "Стальное литье марганцовистая, 12-14% Mn").

metal_name(m_05_11, "Ферритная, мартенситная (прутки/поковки) в состоянии поставки (сырая)").
metal_name(m_05_12, "Ферритная, мартенситная (прутки/поковки) дисперсионно-твердеющая").
metal_name(m_05_13, "Ферритная, мартенситная (прутки/поковки) термообработанная").

metal_name(m_05_21, "Аустенитная (прутки/поковки) аустенитная").
metal_name(m_05_22, "Аустенитная (прутки/поковки) дисперсионно-твердеющая").
metal_name(m_05_23, "Аустенитная (прутки/поковки) сверхаустенитная").

metal_name(m_05_51, "Аустенитно-ферритная (дуплекс) (прутки/поковки) свариваемая < 0.05%C").
metal_name(m_05_52, "Аустенитно-ферритная (дуплекс) (прутки/поковки)").

metal_name(m_15_11, "Ферритная, мартенситная литье не подвергнутое старению в состоянии поставки (сырая)").
metal_name(m_15_13, "Ферритная, мартенситная литье не подвергнутое старению термообработанная").

metal_name(m_15_21, "Аустенитная литье не подвергнутое старению аустенитная").
metal_name(m_15_22, "Аустенитная литье не подвергнутое старению дисперсионно-твердеющая").

metal_name(m_15_51, "Аустенитно-ферритная (дуплекс) литье не подвергнутое старению свариваемая < 0.05%C").
metal_name(m_15_52, "Аустенитно-ферритная (дуплекс) литье не подвергнутое старению несвариваемая >= 0.05%C").

metal_name(k_07_01, "Ковкий чугун ферритный (элементная стружка)").
metal_name(k_07_02, "Ковкий чугун перлитный (сливная стружка)").

metal_name(k_08_01, "Серый чугун низкой прочности").
metal_name(k_08_02, "Серый чугун высокой прочности").

metal_name(k_09_01, "Серый чугун с шаровидным графитом ферритный").
metal_name(k_09_02, "Серый чугун с шаровидным графитом перлитный").

metal_name(n_30_11, "Аллюминиевые сплавы деформированные, в т.ч. холоднообработанные, не подвергнутые старению").
metal_name(n_30_12, "Аллюминиевые сплавы деформированные, в т.ч. холоднообработанные, не подвергнутые старению").

metal_name(n_30_21, "Аллюминиевые сплавы литье не подвергнутое старению").
metal_name(n_30_22, "Аллюминиевые сплавы литье, в т.ч подвергнутое старению").

metal_name(n_33_01, "Медь и медные сплавы легкообрабатываемые сплавы, ≥1% Pb").
metal_name(n_33_02, "Медь и медные сплавы латунь, свинцовистая бронза, <=1% Рb").
metal_name(n_33_03, "Медь и медные сплавы бронза без добавок свинца и медь, в т.ч. электролитическая").

metal_name(s_20_11, "На основе железа отжиг или отпуск в расплаве солей").
metal_name(s_20_12, "На основе железа подвергнутые старению, в т.ч. после отжига в расплаве солей").

metal_name(s_20_21, "Hа основе никеля отжиг или отпуск в расплаве солей").
metal_name(s_20_22, "Hа основе никеля подвергнутые старению, в т.ч. после отжига в расплаве солей").
metal_name(s_20_24, "Hа основе никеля литье, в т. ч. подвергнутое старению").

metal_name(s_20_31, "На основе кобальта Отжиг или отпуск в составе солей").
metal_name(s_20_32, "На основе кобальта Старение после отжига в расплаве солей").
metal_name(s_20_33, "На основе кобальта Литье, в т. ч. подвергнутое старению").

metal_name(s_23_01, "Технический чистый (99.5% Ti)").

metal_name(s_23_21, "Титановые сплавы alpha, близкие к alpha и alpha+beta сплавам, отожженные alpha+beta сплавы").
metal_name(s_23_22, "Титановые сплавы").

metal_name(h_04_01, "Закаленная сталь Закаленная и отпущенная").

metal_name(h_10_01, "После закалки и отпуска Литье, в т. ч. подвергнутое старению").

% Характеристики металлов. power - удельная сила резания, hv - твердость по Бринеллю.
metal_properties("P", p_01_01, power(2000), hv(125)).
metal_properties("P", p_01_02, power(2100), hv(150)).
metal_properties("P", p_01_03, power(2200), hv(170)).

metal_properties("P", p_02_01, power(2150), hv(180)).
metal_properties("P", p_02_02, power(2550), hv(275)).
metal_properties("P", p_02_03, power(2850), hv(350)).

metal_properties("P", p_03_11, power(2500), hv(200)).
metal_properties("P", p_03_21, power(3900), hv(325)).

metal_properties("P", p_06_01, power(2000), hv(180)).
metal_properties("P", p_06_02, power(2100), hv(200)).
metal_properties("P", p_06_03, power(2650), hv(225)).
metal_properties("P", p_06_33, power(3600), hv(250)).

metal_properties("M", m_05_11, power(2300), hv(200)).
metal_properties("M", m_05_12, power(3550), hv(330)).
metal_properties("M", m_05_13, power(2850), hv(330)).

metal_properties("M", m_05_21, power(2300), hv(180)).
metal_properties("M", m_05_22, power(3550), hv(330)).
metal_properties("M", m_05_23, power(2950), hv(200)).

metal_properties("M", m_05_51, power(2550), hv(230)).
metal_properties("M", m_05_52, power(3050), hv(260)).

metal_properties("M", m_15_11, power(2100), hv(200)).
metal_properties("M", m_15_13, power(2650), hv(330)).

metal_properties("M", m_15_21, power(2200), hv(189)).
metal_properties("M", m_15_22, power(3150), hv(330)).

metal_properties("M", m_15_51, power(2250), hv(230)).
metal_properties("M", m_15_52, power(2750), hv(260)).

metal_properties("K", k_07_01, power(940), hv(130)).
metal_properties("K", k_07_02, power(1100), hv(230)).

metal_properties("K", k_08_01, power(1100), hv(180)).
metal_properties("K", k_08_02, power(1150), hv(220)).

metal_properties("K", k_09_01, power(1050), hv(160)).
metal_properties("K", k_09_02, power(1750), hv(250)).

metal_properties("N", n_30_11, power(500), hv(60)).
metal_properties("N", n_30_12, power(800), hv(100)).

metal_properties("N", n_30_21, power(750), hv(75)).
metal_properties("N", n_30_22, power(900), hv(90)).

metal_properties("N", n_33_01, power(700), hv(110)).
metal_properties("N", n_33_02, power(700), hv(90)).
metal_properties("N", n_33_03, power(1750), hv(100)).

metal_properties("S", s_20_11, power(3000), hv(200)).
metal_properties("S", s_20_12, power(3050), hv(280)).

metal_properties("S", s_20_21, power(3300), hv(250)).
metal_properties("S", s_20_22, power(3600), hv(350)).
metal_properties("S", s_20_23, power(3700), hv(320)).

metal_properties("S", s_20_31, power(3300), hv(200)).
metal_properties("S", s_20_32, power(3700), hv(300)).
metal_properties("S", s_20_33, power(3800), hv(320)).

metal_properties("S", s_23_01, power(1550), hv(400)).

metal_properties("S", s_23_21, power(1700), hv(950)).
metal_properties("S", s_23_22, power(1700), hv(1050)).

metal_properties("H", h_04_01, power(5500), hv(614)).

metal_properties("H", h_10_01, power(2800), hv(400)).

% Границы подачи (f) для каждой группы.
metal_h("H", h(5, 10)).
metal_h("S", h(5, 30)).
metal_h("N", h(5, 50)).
metal_h("K", h(5, 50)).
metal_h("M", h(5, 50)).
metal_h("P", h(5, 50)).

% Скорости обработки в зависимости от вида металла и типа покрытия.
metal_v(p_01_01, "CT525", v(170, 235)).
metal_v(p_01_02, "CT525", v(155, 220)).
metal_v(p_01_03, "CT525", v(145, 210)).

metal_v(p_02_01, "CT525", v(145, 205)).
metal_v(p_02_02, "CT525", v(120, 185)).
metal_v(p_02_03, "CT525", v(100, 150)).

metal_v(p_03_11, "CT525", v(100, 130)).
metal_v(p_03_21, "CT525", v(50, 80)).

metal_v(p_06_01, "CT525", v(100, 150)).
metal_v(p_06_02, "CT525", v(85, 135)).
metal_v(p_06_03, "CT525", v(70, 115)).
metal_v(p_06_33, "CT525", v(50, 75)).

metal_v(p_01_01, "GC3115", v(185, 355)).
metal_v(p_01_02, "GC3115", v(140, 330)).
metal_v(p_01_03, "GC3115", v(125, 300)).

metal_v(p_02_01, "GC3115", v(135, 290)).
metal_v(p_02_02, "GC3115", v(105, 270)).
metal_v(p_02_03, "GC3115", v(85, 220)).

metal_v(p_03_11, "GC3115", v(115, 260)).
metal_v(p_03_21, "GC3115", v(75, 205)).

metal_v(p_06_01, "GC3115", v(75, 175)).
metal_v(p_06_02, "GC3115", v(90, 200)).
metal_v(p_06_03, "GC3115", v(75, 160)).
metal_v(p_06_33, "GC3115", v(50, 90)).

metal_v(p_01_01, "GC3020", v(185, 355)).
metal_v(p_01_02, "GC3020", v(140, 330)).
metal_v(p_01_03, "GC3020", v(125, 300)).

metal_v(p_02_01, "GC3020", v(135, 290)).
metal_v(p_02_02, "GC3020", v(105, 270)).
metal_v(p_02_03, "GC3020", v(85, 220)).

metal_v(p_03_11, "GC3020", v(115, 260)).
metal_v(p_03_21, "GC3020", v(75, 205)).

metal_v(p_06_01, "GC3020", v(75, 175)).
metal_v(p_06_02, "GC3020", v(90, 200)).
metal_v(p_06_03, "GC3020", v(75, 160)).
metal_v(p_06_33, "GC3020", v(50, 90)).

metal_v(m_05_11, "CT525", v(175, 400)).
metal_v(m_05_12, "CT525", v(95, 215)).
metal_v(m_05_13, "CT525", v(110, 255)).

metal_v(m_05_21, "CT525", v(190, 435)).
metal_v(m_05_22, "CT525", v(100, 235)).
metal_v(m_05_23, "CT525", v(115, 260)).

metal_v(m_05_51, "CT525", v(145, 335)).
metal_v(m_05_52, "CT525", v(130, 300)).

metal_v(m_05_11, "GC3115", v(135, 195)).
metal_v(m_05_12, "GC3115", v(95, 135)).
metal_v(m_05_13, "GC3115", v(100, 150)).

metal_v(m_05_21, "GC3115", v(130, 190)).
metal_v(m_05_22, "GC3115", v(80, 115)).
metal_v(m_05_23, "GC3115", v(90, 130)).

metal_v(m_05_51, "GC3115", v(90, 115)).
metal_v(m_05_52, "GC3115", v(70, 90)).

metal_v(m_15_11, "GC3115", v(115, 165)).
metal_v(m_15_13, "GC3115", v(75, 110)).

metal_v(m_15_21, "GC3115", v(110, 160)).
metal_v(m_15_22, "GC3115", v(65, 95)).

metal_v(m_15_51, "GC3115", v(80, 100)).
metal_v(m_15_52, "GC3115", v(60, 80)).

metal_v(m_05_11, "GC3020", v(105, 140)).
metal_v(m_05_12, "GC3020", v(75, 100)).
metal_v(m_05_13, "GC3020", v(80, 110)).

metal_v(m_05_21, "GC3020", v(70, 105)).
metal_v(m_05_22, "GC3020", v(50, 85)).
metal_v(m_05_23, "GC3020", v(60, 70)).

metal_v(m_05_51, "GC3020", v(65, 100)).
metal_v(m_05_52, "GC3020", v(29, 50)).

metal_v(m_15_11, "GC3020", v(90, 120)).
metal_v(m_15_13, "GC3020", v(60, 80)).

metal_v(m_15_21, "GC3020", v(90, 115)).
metal_v(m_15_22, "GC3020", v(65, 70)).

metal_v(m_15_51, "GC3020", v(60, 85)).
metal_v(m_15_52, "GC3020", v(26, 45)).

metal_v(k_07_01, "GC3020", v(120, 230)).
metal_v(k_07_01, "GC3115", v(170, 340)).
metal_v(k_07_01, "GC1015", v(95, 110)).

metal_v(k_07_02, "GC3020", v(85, 180)).
metal_v(k_07_02, "GC3115", v(115, 250)).
metal_v(k_07_02, "GC1015", v(60, 75)).

metal_v(k_08_01, "GC3020", v(105, 250)).
metal_v(k_08_01, "GC3115", v(140, 290)).
metal_v(k_08_01, "GC1015", v(70, 90)).

metal_v(k_08_02, "GC3020", v(100, 205)).
metal_v(k_08_02, "GC3115", v(120, 250)).
metal_v(k_08_02, "GC1015", v(65, 85)).

metal_v(k_09_01, "GC3020", v(85, 180)).
metal_v(k_09_01, "GC3115", v(115, 260)).
metal_v(k_09_01, "GC1015", v(60, 75)).
metal_v(k_09_02, "GC3020", v(85, 150)).
metal_v(k_09_02, "GC3115", v(100, 205)).
metal_v(k_09_02, "GC1015", v(50, 65)).

metal_v(n_30_11, "H10", v(710, 2400)).
metal_v(n_30_11, "CD1810", v(150, 2500)).
metal_v(n_30_11, "CD10", v(465, 2000)).

metal_v(n_30_12, "H10", v(275, 810)).
metal_v(n_30_12, "CD1810", v(150, 2500)).
metal_v(n_30_12, "CD10", v(465, 2000)).

metal_v(n_30_21, "H10", v(275, 830)).
metal_v(n_30_21, "CD1810", v(150, 2500)).
metal_v(n_30_21, "CD10", v(465, 2000)).
metal_v(n_30_22, "H10", v(510, 200)).
metal_v(n_30_22, "CD1810", v(150, 2500)).
metal_v(n_30_22, "CD10", v(465, 2000)).

metal_v(n_33_01, "CD1810", v(150, 800)).
metal_v(n_33_01, "CD10", v(325, 800)).
metal_v(n_33_02, "CD1810", v(150, 800)).
metal_v(n_33_02, "CD10", v(325, 800)).
metal_v(n_33_03, "CD1810", v(150, 400)).
metal_v(n_33_03, "CD10", v(185, 400)).

metal_v(s_20_11, "GC1005", v(120, 180)).
metal_v(s_20_11, "S05F", v(120, 180)).
metal_v(s_20_12, "GC1005", v(100, 150)).
metal_v(s_20_12, "S05F", v(100, 150)).
metal_v(s_20_21, "GC1005", v(55, 90)).
metal_v(s_20_21, "S05F", v(55, 90)).
metal_v(s_20_22, "GC1005", v(50, 80)).
metal_v(s_20_22, "S05F", v(50, 80)).
metal_v(s_20_24, "GC1005", v(45, 70)).
metal_v(s_20_24, "S05F", v(45, 70)).
metal_v(s_20_31, "GC1005", v(60, 90)).
metal_v(s_20_31, "S05F", v(60, 90)).
metal_v(s_20_32, "GC1005", v(50, 80)).
metal_v(s_20_32, "S05F", v(50, 80)).
metal_v(s_20_33, "GC1005", v(45, 70)).
metal_v(s_20_33, "S05F", v(45, 70)).
metal_v(s_23_01, "H10", v(150, 190)).
metal_v(s_23_21, "H10", v(60, 80)).
metal_v(s_23_22, "H10", v(55, 70)).

metal_v(h_04_01, "CB20", v(125, 130)).
metal_v(h_04_01, "CC670", v(100, 110)).
metal_v(h_10_01, "CB20", v(195, 200)).
metal_v(h_10_01, "CC670", v(100, 110)).
