create database rk3;

drop table if exists employee cascade;
drop table if exists kpp cascade;

create table employee (
  id int not null primary key,
  fio varchar,
  bd date,
  dep varchar
);

create table kpp(
    eid int references employee(id) not null,
    kdate date,
    weekday varchar,
    ktime time,
    ktype int
);


insert into employee(
    id,
    fio,
    bd,
    dep
) values
      (1, 'FIO1', '1995-09-25', 'IT'),
      (2, 'FIO2', '1999-07-31', 'IT'),
      (3, 'FIO3', '1990-05-03', 'IT'),
      (4, 'FIO4', '1998-02-22', 'IT'),
      (5, 'FIO5', '1994-08-21', 'IT'),
      (6, 'FIO6', '1999-12-01', 'IT'),
      (7, 'FIO7', '1990-07-23', 'IT'),
      (8, 'FIO8', '1997-04-15', 'IT'),
      (9, 'FIO9', '1990-03-12', 'IT'),
      (10, 'FIO10', '1991-02-16', 'IT'),
      (11, 'FIO11', '1992-05-19', 'CALL'),
      (12, 'FIO12', '1993-11-09', 'F'),
      (13, 'FIO13', '1994-03-03', 'F'),
      (14, 'FIO14', '1995-06-16', 'IT'),
      (15, 'FIO15', '1996-02-28', 'CALL'),
      (16, 'FIO16', '1996-05-24', 'F'),
      (17, 'FIO17', '1990-01-01', 'F'),
      (18, 'FIO18', '1990-01-02', 'IT'),
      (19, 'FIO19', '1990-01-03', 'CALL'),
      (20, 'FIO20', '1999-03-29', 'F');


insert into kpp(
    eid,
    kdate,
    weekday,
    ktime,
    ktype
) values
      (1, '2022-09-19', 'Понедельник', '09:01', 1),
      (1, '2022-09-19', 'Понедельник', '09:12', 2),
      (1, '2022-09-19', 'Понедельник', '09:40', 1),
      (1, '2022-09-19', 'Понедельник', '12:01', 2),
      (1, '2022-09-19', 'Понедельник', '13:40', 1),
      (1, '2022-09-19', 'Понедельник', '14:01', 2),
      (1, '2022-09-19', 'Понедельник', '15:40', 1),
      (1, '2022-09-19', 'Понедельник', '20:41', 2),

      (1, '2022-09-21', 'Cреда', '09:02', 1),
      (1, '2022-09-21', 'Cреда', '09:12', 2),
      (1, '2022-09-21', 'Cреда', '09:40', 1),
      (1, '2022-09-21', 'Cреда', '12:01', 2),
      (1, '2022-09-21', 'Cреда', '13:40', 1),
      (1, '2022-09-21', 'Cреда', '20:40', 2),

      (1, '2022-09-22', 'Четверг', '09:01', 1),
      (1, '2022-09-22', 'Четверг', '09:12', 2),
      (1, '2022-09-22', 'Четверг', '09:42', 1),
      (1, '2022-09-22', 'Четверг', '12:01', 2),
      (1, '2022-09-22', 'Четверг', '13:40', 1),
      (1, '2022-09-22', 'Четверг', '20:40', 2),

      (3, '2022-09-21', 'Cреда', '09:01', 1),
      (3, '2022-09-21', 'Cреда', '09:12', 2),
      (3, '2022-09-21', 'Cреда', '09:40', 1),
      (3, '2022-09-21', 'Cреда', '12:01', 2),
      (3, '2022-09-21', 'Cреда', '13:43', 1),
      (3, '2022-09-21', 'Cреда', '20:40', 2),

      (2, '2022-09-21', 'Cреда', '08:51', 1),
      (2, '2022-09-21', 'Cреда', '20:31', 2),

      (4, '2022-09-21', 'Cреда', '09:50', 1),
      (4, '2022-09-21', 'Cреда', '20:31', 2),

      (19, '2022-09-21', 'Cреда', '09:51', 1),
      (19, '2022-09-21', 'Cреда', '20:30', 2),

      (1, '2022-09-23', 'Пятница', '09:11', 1),
      (1, '2022-09-23', 'Пятница', '09:12', 2),
      (1, '2022-09-23', 'Пятница', '09:40', 1),
      (1, '2022-09-23', 'Пятница', '20:01', 2),

      (3, '2022-09-23', 'Пятница', '09:01', 1),
      (3, '2022-09-23', 'Пятница', '09:14', 2),
      (3, '2022-09-23', 'Пятница', '09:50', 1),
      (3, '2022-09-23', 'Пятница', '20:01', 2),

      (2, '2022-09-23', 'Пятница', '08:41', 1),
      (2, '2022-09-23', 'Пятница', '20:31', 2),

      (16, '2022-09-23', 'Пятница', '09:51', 1),
      (16, '2022-09-23', 'Пятница', '20:31', 2);

-- Написать скалярную функцию, возвращающую количество сотрудников в возрасте от 18 до
-- 40, выходивших более 3х раз.  - extract(year from bd)
create or replace function out3_cnt(my_date date) returns int
as $$
begin
    return (select count(*)
           from (
                    select distinct id
                    from employee
                    where (current_date - bd)/365 between 18 and 40 and
                            id in (select eid
                                   from kpp
                                   where kdate = my_date
                                   group by eid, kdate, ktype
                                   having ktype = 2 and count(*) > 3
                            )
           ) as tmp2
    );
end;
$$ language plpgsql;

select * from out3_cnt('2022-09-19');

-- 2.1) Отделы, в которых работает более 10 чел
select dep
from employee
group by dep
having count(id) > 10;

-- 2.2) Сотрудников, которые не выходят с места весь рабочий день (пусть рабочий день c 9:00 до 18:00)
select id, fio
from employee
where id in(
    select eid
    from kpp
    group by eid, kdate, ktype
    having ktype=2 and min(ktime) >= '18:00'
);

--2.3) Отделы, где есть сотрудники, опоздавшие в данный день
select distinct dep
from employee
where id in
      (
          select eid
          from kpp
          where ktype = 1 and kdate = '2022-09-21'
          group by eid
          having min(ktime) > '9:00'
      );